#+STARTUP: overview indent num align inlineimages logdone hidestars hideblocks
#+OPTIONS: ^:{}
#+OPTIONS: ^:nil
#+TITLE: config.org

**** TODO 説明
Emacs標準のメール送信機能を利用するための設定です[fn:sending-mail]。

日本語メールを送信するには、[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Language-Environments.html][Language Environments]]が正しく設定されている必要があります。

メールを編集して送信するコマンドは次の通りです。

| C-x m   | メール編集（Messageモード） |
| C-c C-c | メール送信                 |
| C-c C-a | ファイルの添付[fn:mime]    |

関連する設定ファイルです。

| ~/.signature | メール署名[fn:signature]           |
| ~/.authinfo  | smtpサーバ・パスワード[fn:authinfo] |
| ~/.netrc     | エイリアス                         |

ユーザ名とアカウントを設定します。

#+begin_src emacs-lisp
  (setq user-full-name "Yoshihide Chubachi")
  (setq user-mail-address "yc@aiit.ac.jp")
#+end_src

#+RESULTS:
: yc@aiit.ac.jp

メールユーザエージェント（mua）をMessageモードにします。

#+begin_src emacs-lisp
  (setq mail-user-agent 'message-user-agent)
#+end_src

#+RESULTS:
: message-user-agent

Messageモードからの送信にsmtpmailを用うように設定します[fn:smtp]。
- [[https://www.maketecheasier.com/use-email-within-emacs/#setting-up-emacs-to-send-email][How to Use Email within Emacs - Make Tech Easier]]

#+begin_src emacs-lisp
  (setq message-send-mail-function 'smtpmail-send-it)
#+end_src

#+RESULTS:
: smtpmail-send-it

smtpmailの設定をします。

#+begin_src emacs-lisp
  (setq smtpmail-stream-type 'starttls
        smtpmail-smtp-server "smtp.gmail.com"
        smtpmail-smtp-service 587)
#+end_src

#+RESULTS:
: 587

SMTPのパスワードは~/.authinfoで設定します。

なお、Googleで二段階認証を設定している場合、アプリパスワードを生成して設定する必要があります[fn:google-app-password]。

[fn:sending-mail] [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Sending-Mail.html][https://www.gnu.org/software/emacs/manual/html_node/emacs/Sending-Mail.html]]
[fn:signature] mail-signatureがtのとき（ディフォルトでt）、mail-signature-file（標準では~/.singature）が挿入されます
[fn:authinfo] .authinfoがない場合、初回送信時に自動で作成されます。
[fn:mime] [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Mail-Misc.html][https://www.gnu.org/software/emacs/manual/html_node/emacs/Mail-Misc.html]]
[fn:smtp] [[https://www.gnu.org/software/emacs/manual/html_mono/smtpmail.html#How-Mail-Works][https://www.gnu.org/software/emacs/manual/html_mono/smtpmail.html#How-Mail-Works]]
[fn:google-app-password] [[https://kyopc.at.webry.info/202112/article_1.html][Googleの二段階認証開始後にGoogleメールにPOP3/SMTPアクセスする（mewなど）: kyoはパソコンMaster or Slave?]]

*** elisp編集時にoutline-minnor-modee

#+begin_src emacs-lisp
  (leaf *emacs-lisp-mode-hook
    :config
    (add-hook
     'emacs-lisp-mode-hook
     'outline-minor-mode))
#+end_src

#+RESULTS:
: *emacs-lisp-mode-hook

#+begin_src emacs-lisp :tangle no :results value pp
;after-save-hook
emacs-lisp-mode-hook
;(current-buffer)
#+end_src

#+RESULTS:
: (ert--activate-font-lock-keywords outline-minor-mode enable-paredit-mode flycheck-mode)

